Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob/sme/admin/depts/other_files/Forskrift_rammeplan_samiske_grunnskolelaererutdanninger_samiskversjon.pdf.tmx
Source language: sme
Languages: nob

source: Rámmaplána láhkaásahus Sámi allaskuvlla sámi vuođđoskuvlaoahpaheaddjeoahpuid 1.–7. dássái ja 5.–10. dássái § 1 – DOAIBMAVIIDODAT JA ULBMIL Láhkaásahus gusto sámi vuođđoskuvlaoahpaheaddjeoahpuide maid Sámi allaskuvla lágida .
nob: Forskrift om rammeplan for samiske grunnskolelærerutdanninger for 1.–7. trinn og 5.–10. trinn ved Samisk høgskole § 1 VIRKEOMRÅDE OG FORMÅL Forskriften gjelder samisk grunnskolelærerutdanning som tilbys ved Samisk høgskole .

source: Allaskuvla lea akkrediterejuvvon universitehtaid ja allaskuvllaid lága § 1-2 ja § 3-1 vuođul .
nob: Høgskolen er akkreditert etter lov om universitet og høgskoler § 1-2 og § 3-1 .

source: Sámi vuođđoskuvlaoahpaheaddjeoahppu lea ovttaárvosaš našunála vuođđoskuvlaoahpaheaddjeoahpuin .
nob: Den samiske grunnskolelærerutdanningen er likeverdig med den norske grunnskolelærerutdanningen .

source: Sámi vuođđoskuvlaoahpaheaddjeoahpu oahpahusgiellan lea sámegiella nu guhkás go lea vejolaš .
nob: Samisk grunnskolelærerutdanning skal , så langt det er mulig , ha samisk som undervisningsspråk .

source: Sámi vuođđoskuvlaoahpaheaddjioahpu vuođđogeađgin lea sámekultuvra ja sámeservodat , mas sámi oahppanáddejumit ja oahpahusvuogit leat vuolggasadjin .
nob: Samisk grunnskolelærerutdanning er forankret i samisk kultur og samfunn og har samiske læringsforståelser og undervisningsmåter som sitt utgangspunkt .

source: Sámi vuođđoskuvlaoahpaheaddjeoahppu addá máŋggabealat máhtu sámi dilálašvuođain .
nob: Den samiske grunnskolelærerutdanningen gir allsidig kjennskap til samiske forhold .

source: Láhkaásahus gusto Sámi allaskuvlla 4-jagáš vuođđoskuvlaoahpaheaddjeohppui .
nob: Forskriften gjelder for 4-årig grunnskolelærerutdanning ved Samisk høgskole .

source: Láhkaásahus meroštallá sámi vuođđoskuvlaoahpaheaddjeoahpuid 1.–7. dási ja 5.–10. dási rámmaid .
nob: Forskriften definerer rammene for de samiske grunnskolelærerutdanningene for 1.–7. trinn og 5.–10. trinn .

source: Láhkaásahusa ulbmil lea sihkkarastit , ahte Sámi allaskuvla fállá integrerejuvvon , profešuvdnii ráhkkanahtti ja dutkanvuđđosaš vuođđoskuvlaoahpaheaddjeoahpuid main lea alla fágalaš kvalitehta .
nob: Forskriftens formål er å sikre at Samisk høgskole tilbyr integrerte , profesjonsrettete og forskningsbaserte grunnskolelærerutdanninger med høy faglig kvalitet .

source: Oahput galget čuovvut Oahpahuslága ja vuođđooahpahussii gustovaš oahppoplánaid .
nob: Utdanningene skal forholde seg til opplæringsloven og gjeldende læreplanverk for grunnopplæringen .

source: Sámi allaskuvla galgá lágidit integrerejuvvon vuođđoskuvlaoahpaheaddjeoahpuid , main lea ollisvuohta ja oktiigullevašvuohta teoriija- ja hárjehallanoahpuiguin , fágaiguin ja fágadidaktihkain ja fágaid gaskkas .
nob: Samisk høgskole skal legge til rette for integrerte grunnskolelærerutdanninger med helhet og sammenheng mellom teori- og praksisstudier , mellom fag og fagdidaktikk og mellom fag .

source: Vuođđoskuvlaoahpaheaddjeoahput galget addit kandidáhtaide nana fágalaš ja didákttalaš máhtuid , gealbudahttit sin atnit ávkin dutkama oahpaheaddjeámmáhis ja ámmátlaš ovdáneamis jeavddalaččat .
nob: Grunnskolelærerutdanningene skal gi kandidatene solide faglige og didaktiske kunnskaper , kvalifisere for forskningsbasert yrkesutøvelse og for kontinuerlig profesjonell utvikling .

source: Oahpuid iešvuohtan lea lagas ovttasdoaibman profešuvdnasurggiiguin ja iešguđetlágan servodatdoibmiiguin .
nob: Utdanningene skal kjennetegnes av et nært samspill med profesjonsfeltet og ulike samfunnsaktører .

source: Oahput galget čatnat oahpaheaddjeámmáha historjjálaš kontekstii ja áigeguovdilis servodatperspektiivii , ja oahpahit kritihkalaččat reflekteret ja hukset profešuvdnaáddejumi .
nob: Utdanningene skal sette læreryrket inn i en historisk og samfunnsmessig sammenheng og bidra til kritisk refleksjon og profesjonsforståelse .

source: Sámi vuođđoskuvlaoahpaheaddjeoahppu galgá čatnat oahpaheaddjeámmáha sámi oktavuhtii ja álgoálbmotoktavuhtii .
nob: Samisk grunnskolelærerutdanning skal sette læreryrket inn i en samisk kontekst og urfolkskontekst .

source: Vuođđoskuvlaoahpaheaddjeoahput kvalifiserejit kandidáhtaid bastit oahpahit sámi dilálašvuođaid birra ja sii galget diehtit sámi mánáid oahppovuoigatvuođaid , mat albmanit oahpahuslágas ja vuođđooahpahussii gustovaš oahppoplánain .
nob: Grunnskolelærerutdanningene skal kvalifisere kandidatene til å ivareta opplæring om samiske forhold og ha kunnskap om samiske barns rett til opplæring i tråd med opplæringsloven og gjeldende læreplanverk for grunnopplæringen . §

source: § 2 OAHPPANJOKSOSAT Sámi vuođđoskuvlaoahpaheaddjeoahput gealbudahttet oahpaheddjiid bargagoahtit ja čađahit hástaleaddji ja máŋggabealat ámmáha girjás ja rievdi servodagas .
nob: 2 LÆRINGSUTBYTTE De samiske grunnskolelærerutdanningene skal kvalifisere lærere til å utøve et krevende og komplekst yrke i et samfunn som preges av mangfold og endring .

source: Oahppanjoksosat leat hábmejuvvon našunála kvalifiserenrámmaid vuođul .
nob: Læringsutbytte er formulert med utgangspunkt i nasjonalt kvalifikasjonsrammeverk .

source: Go kandidáhttá lea ollašuhttán vuođđoskuvlaoahpaheaddjeoahpu , de galgá son leat olahan oahppanjoksosiid mat čilgejuvvojit máhtu , gálggaid ja oppalaš gelbbolašvuođa vuođul .
nob: Kandidaten skal etter fullført grunnskolelærerutdanning ha følgende læringsutbytte definert som kunnskap , ferdigheter og generell kompetanse , som fundament for arbeid i skolen og videre kompetanseutvikling .

source: Dát leat vuođđun skuvlabarggus ja viidásut gelbbolašvuođaovdáneamis .
nob: Læringsutbytte særskilt for kandidater 1.–7. trinn : Kandidaten … - har faglige og fagdidaktiske kunnskaper i samisk , matematikk , norsk og øvrige fag som inngår i utdanningen , og solid kunnskap om begynneropplæring

source: Oahppanjoksosat erenoamážit 1.–7. dási kandidáhtaide : Kandidáhtas lea fágalaš ja fágadidákttalaš máhttu sámegielas , matematihkas , dárogielas ja eará oahppofágain ja nana máhttu álgooahpahusas lea máhttu bargat vuođđogálggaiguin ( ovdanbuktit njálmmálaččat , lohkat , ovdanbuktit čálalaččat , rehkenastit , geavahit digitála reaidduid ) fágaid siskkobealde ja fágaid rastá , ja máhttá lágidit diliid , mat ovdánahttet 1.–7. dási ohppiide heivehuvvon oahpahusa lea máhttu ollislaš oahppooalis , mas erenoamážit deattuhit sirdašumi mánáidgárddis skuvlii ja mánáidskuvladásis nuoraidskuvladássái Oahppanjoksosat erenoamážit 5.–10. dási kandidáhtaide : Kandidáhtas lea nana fágalaš ja fágadidákttalaš máhttu sámegielas ja eará oahppofágain ja ráddjejuvvon fágaid diehto- ja máhttovuođuin lea máhttu bargat ja ovdánahttit vuođđogálggaid ( ovdanbuktit njálmmálaččat , lohkat , ovdanbuktit čálalaččat , rehkenastit , geavahit digitála reaidduid ) fágaid siskkobealde ja fágaid rastá , ja máhttá lágidit diliid , mat ovdánahttet 5.–10. dási ohppiide heivehuvvon oahpahusa lea máhttu ollislaš oahppooalis , mas erenoamážit deattuhit sirdašumi mánáidskuvladásis nuoraidskuvladássái ja nuoraidskuvladásis joatkkaskuvlaoahpu dássái Oktasaš oahppanjoksosat goappaš oahpuid kandidáhtaide : Oahppanjoksosat biddjojit dán guovtti vuođđoskuvlaoahpaheaddjeoahpu fágaid sisdoaluid ja bargovugiid oktavuhtii .
nob: 1 - har kunnskap om arbeid med grunnleggende ferdigheter ( utrykke seg muntlig , lese , utrykke seg skriftlig , regne , bruke digitale verktøy ) i og på tvers av fag , og kan tilrettelegge for progresjon i opplæringen av disse ferdighetene tilpasset elever på 1.–7. trinn - har kunnskap om det helhetlige opplæringsløpet , med vekt på overgangen fra barnehage til skole og barnetrinn til ungdomstrinn Læringsutbytte særskilt for kandidater 5.–10. trinn : Kandidaten … - har solide faglige og fagdidaktiske kunnskaper i samisk og de øvrige fagene som inngår i utdanningen og om fagenes kunnskapsmessige forankring - har kunnskap om arbeid med videreutvikling av grunnleggende ferdigheter ( utrykke seg muntlig , lese , utrykke seg skriftlig , regne , bruke digitale verktøy ) i og på tvers av fag , og kan tilrettelegge for progresjon i disse ferdighetene i opplæringen tilpasset elever på 5.–10. trinn - har kunnskap om det helhetlige opplæringsløpet , med vekt på overgangen fra barnetrinn til ungdomstrinn og ungdomstrinn til videregående opplæring Felles læringsutbytte for kandidater i begge utdanningsløp : Læringsutbytte må ses i sammenheng med fagenes innhold og arbeidsmåter i de to grunnskolelærerutdanningene .

source: MÁHTTU Kandidáhtas lea máhttu skuvlla ja oahpaheaddjeámmáha iešvuođain , historjjás , ovdáneamis ja sajádagas sámi servodagas ja servodagas muđui , ja skuvlla ulbmila , árvovuođu , lágaid , gustovaš oahppoplánaid ja iešguđetlágan ohppiid vuoigatvuođaid birra lea máhttu oahppoplánabargguin ja skuvllas organisašuvdnan lea máhttu mánáid ja nuoraid oahppamis , ovdáneamis ja oppalaščuvgejumis iešguđetlágan sosiála , máŋggakultuvrralaš ja máŋggagielalaš konteavsttain lea máhttu luohkkájođiheamis ja luohkkábirrasis ja máhttá ovdánahttit buriid oktavuođaid ohppiiguin ja ohppiid gaskkas lea máhttu máŋggalágan bargovugiin ja oahppanresurssain , ja máhttu bargovugiid , sisdoalu ja ohppiid oahppaneavttuid oktiigullevašvuođas lea máhttu mánáid ja nuoraid bajásšaddanbirrasa , dásseárvvu ja identitehtabarggu birra lea máhttu mánáin , geat leat váttis diliin ja mánáid vuoigatvuođain našunála ja riikkaidgaskasaš perspektiivvas , riikkaidgaskasaš šiehtadusaid vuođul , álgoálbmotjulggaštusaid ja našunála lágaid vuođul lea máhttu sámi , našunála ja riikkaidgaskasaš dutkan- ja ovddidanbargguin mat gusket oahpaheaddjeámmáhii lea máhttu sámi árbevirolaš máhtus ovttaskas fágasurggiin lea máhttu sámi mánáid ja nuoraid bajásšaddandilálašvuođaid hástalusain GÁLGGAT Kandidáhtta - máhttá iešheanalaččat ja ovttas earáiguin plánet , čađahit ja reflekteret oahpaheami fágaid siskkobealde ja fágaid rastá , mas vuolggasadjin leat sámi árbevirolaš máhttu , dutkan- ja vásáhusvuđđosaš máhttu - máhttá lágidit dili ja láidestit buriid ja hutkás oahppanbirrasiid - máhttá lágidit dili estehtalaš attáldagaid ovdánahttimii , muosáhussii ja dovddiidussii - máhttá heivehit oahpaheami iešguđetlágan ohppiid dárbbuide ja movttiidahttit oahppanhálu , go čielgasit ovdanbuktá oahppanmihttomeriid , ja geavaha iešguđetlágan bargovugiid olahit ohppiid mihttomeriid - máhttá árvvoštallat ja duođaštit ohppiid oahppama ja ovdáneami oahppomihtuid ektui , rávvet nu ahte ovddida oahppama ja veahkehit ohppiid árvvoštallat iežaset oahppama - máhttá kritihkalaččat reflekteret iežas ja skuvlla geavadiid go ovdánahttá oahpaheaddjerolla ja ámmátetihkalaš gažaldagaid - hálddaša njálmmálaš ja čálalaš sámegiela , máhttá ámmátlaš giellageavaheami ja máhttá oahpahit sámegillii iežas fágain .
nob: KUNNSKAP Kandidaten … - har kunnskap om skolens og lærerprofesjonens egenart , historie , utvikling og plass i det samiske samfunnet og samfunnet forøvrig og om skolens formål , verdigrunnlag , lovgrunnlag , gjeldende læreplaner og ulike elevers rettigheter - har kunnskap om læreplanarbeid og om skolen som organisasjon - har kunnskap om barns og unges læring , utvikling og danning i ulike sosiale , flerkulturelle og flerspråklige kontekster - har kunnskap om klasseledelse og klassemiljø og om utvikling av gode relasjoner til og mellom elever - har kunnskap om et bredt repertoar av arbeidsmåter og læringsressurser og om sammenhengen mellom innhold , arbeidsmåter og elevenes forutsetninger - har kunnskap om barns og unges oppvekstmiljø , likestilling og identitetsarbeid - har kunnskap om barn i vanskelige situasjoner og om barns rettigheter i et nasjonalt og internasjonalt perspektiv , på grunnlag av internasjonale konvensjoner , urfolkserklæringer og nasjonale lover - har kunnskap om samisk , nasjonalt og internasjonalt forsknings- og utviklingsarbeid med relevans for lærerprofesjonen - har kunnskap om samisk tradisjonell kunnskap innenfor det enkelte fagområde - kjenner utfordringer ved oppvekstsvilkårene til samiske barn og unge FERDIGHETER Kandidaten - kan selvstendig og i samarbeid med andre planlegge , gjennomføre og reflektere over undervisning i og på tvers av fag , med utgangspunkt i samisk tradisjonell kunnskap , samt forsknings- og erfaringsbasert kunnskap - kan tilrettelegge for og lede gode og kreative læringsmiljøer - kan tilrettelegge for estetisk utfoldelse , opplevelse og erkjennelse - kan tilpasse opplæringen til ulike elevers behov , motivere til lærelyst gjennom å tydeliggjøre læringsmål og bruke varierte arbeidsmåter for at elevene skal nå målene

source: Hálddaša njálmmálaš ja čálalaš dárogiela , ja máhttá geavahit giela ámmátoktavuođain - máhttá árvvoštallat ja geavahit heivvolaš dutkanbohtosiid ja ieš čađahit systemáhtalaš ovddidanbargguid - máhttá ovttasráđiid váhnenovddasteddjiiguin ja fágalaš ásahusaiguin gávnnahit ja fuobmát ohppiid sierralágan dárbbuid , vai dárbbašlaš doaibmabijut álggahuvvojit - máhttá lágidit dili mii ovddida fidnoálggahangealbbu ( entreprenørskap ) ja máhttá searvvahit oahpaheapmái báikkálaš bargo- ja servodateallima , árbediehtoguddiid ja resursaolbmuid - máhttá ávkin atnit sámi oahppan- ja oahpahanvugiid OPPALAŠ GELBBOLAŠVUOHTA Kandidáhtta - bastá oaččuhit ámmátlaš searvevuođa oahpaheddjiiguin nu , ahte ovdánahttá buori geavada ja ámmátetihkalaš geađgejuolggi - bastá oaččuhit ámmátlaš searvevuođa sámi oahpaheddjiiguin dainna ulbmiliin , ahte ovdánahttit buori geavada ja ámmátetihkalaš geađgejuolggi maiddái riikkarájiid rastá - bastá ovdánahttit demokratiijaáddejumi ja demokráhtalaš oassálastima ja bastá kritihkalaččat reflekteret sierra luohkkádásiid dárbbuid - bastá nannet riikkaidgaskasaš ja máŋggakultuvrralaš áššiid skuvlla barggus - bastá fuobmát iežas oahppan- ja gelbbolašvuođadárbbuid oahpaheaddjeámmáhis - lea háhkan nuppástuhttin- ja ovddidangelbbolašvuođa , mainna bastá dustet skuvlla hástalusaid boahttevuođas - bastá nannet sámi , álgoálbmot ja riikkaidgaskasaš skuvladoaimmaid - bastá doarjut sámi mánáid ja nuoraid ovdáneami ja identitehtahuksema
nob: - kan vurdere og dokumentere elevers læring og utvikling i forhold til opplæringens mål , gi læringsfremmende tilbakemeldinger og bidra til at elever kan vurdere egen læring - kan kritisk reflektere over egen og skolens praksis i arbeidet med videreutvikling av lærerrollen og profesjonsetiske spørsmål - kan mestre samisk muntlig og skriftlig , vise kompetent språkbruk i profesjonssammenhenger og kunne undervise på samisk i sine fag . Mestrer norsk muntlig og skriftlig og kan bruke språket på en kvalifisert måte i profesjonssammenheng - kan vurdere og bruke relevante forskningsresultater og selv gjennomføre systematisk utviklingsarbeid - kan i samarbeid med foresatte og faglige instanser identifisere spesielle behov hos elevene og iverksette nødvendige tiltak - kan legge til rette for utvikling av kompetanse i entreprenørskap og for at lokalt arbeids- og samfunnsliv , tradisjonsbærere og ressurspersoner involveres i opplæringen - kan gjøre nytte av samiske læringsmåter i opplæringen GENERELL KOMPETANSE Kandidaten - kan bidra til profesjonelt lærerfelleskap med tanke på videreutvikling av god praksis og yrkesetisk plattform - kan bidra til profesjonelt fellesskap mellom samiske lærere med tanke på videreutvikling av god praksis og yrkesetisk plattform også på tvers av landegrensene - kan stimulere til demokratiforståelse , demokratisk deltakelse og evne til kritisk refleksjon tilpasset aktuelle klassetrinn - kan bidra til å styrke internasjonale og flerkulturelle dimensjoner ved skolens arbeid - kan identifisere egne lærings- og kompetansebehov i tilknytning til læreryrket - innehar en endrings- og utviklingskompetanse som grunnlag for å møte framtidens skole - kan bidra til å stryke en samisk , urfolks og internasjonal dimensjon ved skolens arbeid - kan utgjøre en støtte for samiske barns og unges utvikling og identitetsbygging . §

source: § 3 SIERRANAHTTI Vuođđoskuvlaoahpaheaddjeoahpu STRUKTUVRA ( 1 ) Spesialiserema ja fágalaš ovttasteami gáibádusat Vuođđoskuvlaoahpaheaddjeoahput leat spesialiserejuvvon skuvlla ahkeluohkáide , ja gealbudahttet oahpahit jogo 1 . –7. dásis dahje 5 .
nob: 3 STRUKTUR FOR DIFFERENSIERT Grunnskolelærerutdanning ( 1 ) Krav til spesialisering og faglig sammensetning Grunnskolelærerutdanningene skal være spesialiserte mot årstrinn i skolen , og kvalifisere for undervisning på henholdsvis 1.–7. trinn og 5.–10. trinn .

source: Oahput lágiduvvojit guovtti čielgasit meroštallojuvvon ja sierranas vuođđoskuvlaoahpaheaddjeoahppun vugiiguin , mat sihkkarastet progrešuvnna ollislaš profešuvdnaoahpus .
nob: Utdanningene skal organiseres som to klart definerte og differensierte grunnskolelærerutdanninger på en måte som sikrer progresjon i en helhetlig profesjonsutdanning .

source: Njealjijagáš 1.–7. dási oahpaheaddjeoahppu doallá sisttis dábálaččat unnimusat njeallje oahpahusfága , main unnimusat okta fága lea 60 oahppočuoggá ja eará fágat leat unnimusat 30 oahppočuoggá .
nob: Fireårig grunnskolelærerutdanning for 1.–7. trinn skal normalt omfatte minimum fire undervisningsfag , der minst ett av fagene skal være på 60 studiepoeng og de andre fagene må være på minimum 30 studiepoeng .

source: Váldodeaddu galgá leat álgooahpahusas .
nob: Hovedvekten skal ligge på begynneropplæring .

source: Okta oahpahusfága 4. oahppojagis sáhttá buhttet ovtta 30. čuoggá skuvlarelevánta fága .
nob: Et undervisningsfag i 4. studieår kan erstattes av ett skolerelevant fag på 30 studiepoeng .

source: Jus joatká masteroahpuin 3. oahppojagi maŋŋá , de masteroahpu vuosttaš jahki buhtte vuođđoskuvlaoahpaheaddjeoahpu 4. oahppojagi fágaid .
nob: Ved overgang til masterutdanning etter 3. studieår vil det første året i masterutdanningen erstatte fag i det 4. studieåret i grunnskolelærerutdanningen .

source: Njealjijagáš 5.-10. dási oahpaheaddjeoahppu doallá sisttis dábálaččat unnimusat golbma oahpahusfága , juohke fága lea 60 oahppočuoggá .
nob: Fireårig grunnskolelærerutdanning for 5.–10. trinn skal normalt omfatte minst tre undervisningsfag , hvert på 60 studiepoeng .

source: Váldodeaddu lea fágalaš čiekŋudeamis .
nob: Hovedvekten skal ligge på faglig fordypning .

source: Ovtta oahpahusfága 4. oahppojagis sáhttá buhttet ovttain oahpahusfágain ja ovttain skuvlarelevánta fágain , main goappásge leat 30 oahppočuoggá , nubbi vejolašvuohta lea guokte oahpahusfága , main goappásge leat 30 oahppočuoggá .
nob: Et undervisningsfag i 4. studieår kan erstattes av ett undervisningsfag og ett skolerelevant fag hver på 30 studiepoeng , eventuelt to undervisningsfag hver på 30 studiepoeng .

source: Geatnegahtton fágat , fágaid ja hárjehallanoahpahusa viidodat Goappaš oahput galget doallat sisttis bagadallojuvvon , árvvoštallojuvvon ja molsašuddi hárjehallanoahpu buot oahppojagiin .
nob: Obligatoriske fag , fagenes og praksisopplæringens omfang I begge utdanningene skal det være veiledet , vurdert og variert praksisopplæring i alle studieårene .

source: Hárjehallanoahppu lea integrerejuvvon oassin buot oahppofágain .
nob: Praksisopplæring skal inngå som en integrert del av alle fagene i utdanningene .

source: Hárjehallanoahpu viidodat lea unnimusat 100 beaivvi njealji jagis ; unnimusat 80 beaivvi golmma vuosttaš oahppojagi , unnimusat 20 beaivvi maŋemus oahppojagi .
nob: Omfanget av praksisopplæringen skal være minst 100 dager fordelt over fire år ; minimum 80 dager i løpet av de to første studieårene , og minimum 20 dager i løpet av de to siste studieårene .

source: Hárjehallanoahppu čađahuvvo vuođđoskuvllas ja juhkkojuvvo sihke vuolit ja alit ahkeluohkáide dan oahpposuorggis , masa oahppu gealbudahttá .
nob: Praksisopplæringen skal være i grunnskolen og fordeles på både lavere og høyere årstrinn i det løpet som utdanningen kvalifiserer for .

source: Hárjehallanoahpus galgá leat progrešuvdna ja heivehuvvot studeanttaid válljenfágaide buot oahppojagiin ja čadnojuvvot iešguđetlágan skuvladoaimmaide .
nob: Det skal være progresjon i praksisopplæringen , og den skal være tilpasset studentenes fagvalg i alle studieårene og knyttet til ulike deler av skolens virksomhet .

source: Hárjehallanoahpu lágideapmi berre speadjalastit miehtásámi perspektiivvaid .
nob: Praksisopplæringen bør tilrettelegges slik at det gjenspeiler et allsamisk perspektiv .

source: Buot oahpahusfágain galgá leat fágadidaktihkka ja galget leat profešuvdnii ráhkkanahtti oahpaheaddjeoahppofágat .
nob: Alle undervisningsfag skal omfatte fagdidaktikk og være profesjonsrettede lærerutdanningsfag .

source: Buot oahpahusfágain , skuvlarelevánta fágain ja fáddájoavkkuin galgá dutkan leat vuođđun ja čanastuvvot dutkanaktiivvalaš fágabirrasiidda .
nob: Alle undervisningsfag og skolerelevante fag og emner skal være forskningsbaserte og forankret i et forskningsaktivt fagmiljø .

source: Bachelorbargu lea geatnegahtton goalmmát oahppojagi .
nob: Bacheloroppgave i det 3. studieåret er obligatorisk .

source: Barggu viidodat lea 15 oahppočuoggá pedagogihka ja oahppimáhtu oahppoollisvuođas . Dieđateoriija ja metodat galget čadnojuvvot bachelorbargui .
nob: Arbeidet med oppgaven og innføring i vitenskapsteori og metode skal utgjøre 15 studiepoeng av pedagogikk og elevkunnskap .

source: Bachelorbargu galgá leat profešuvdnii gullevaš ja temáhtalaččat čatnasit pedagogihkkii ja oahppimáhttui ja/dahje eará fágaide .
nob: Oppgaven skal være profesjonsrettet med tematisk forankring i pedagogikk og elevkunnskap og / eller i andre fag .

source: Barggus berre leat sámi perspektiiva dahje álgoálbmotperspektiiva .
nob: Oppgaven bør ha et samisk perspektiv eller urfolksperspektiv .

source: Vuođđoskuvlaoahpaheaddjeoahpu 1.–7. dásis leat geatnegahtton fágan pedagogihkka ja oahppimáhttu 60 oahppočuoggá , matematihkka 30 oahppočuoggá , sámegiella 30 oahppočuoggá ja dárogiella 30 oahppočuoggá .
nob: For grunnskolelærerutdanning 1.–7. trinn er det obligatorisk med pedagogikk og elevkunnskap 60 studiepoeng , matematikk 30 studiepoeng , samisk 30 studiepoeng og norsk 30 studiepoeng .

source: Vuođđoskuvlaoahpaheaddjeoahpu 5.–10. dásis leat geatnegahtton fágan pedagogihkka ja oahppimáhttu 60 oahppočuoggá .
nob: For grunnskolelærerutdanning 5.–10. trinn er det obligatorisk med pedagogikk og elevkunnskap 60 studiepoeng .

source: Ii oktage oahpahusfága leat geatnegahtton .
nob: Ingen undervisningsfag er obligatoriske .

source: Sámi allaskuvla galgá lágidit dili , vai studeanttat besset váldit riikkaidgaskasaš lohkanbaji 4-jagáš vuođđoskuvlaoahpaheaddjeoahpus .
nob: Samisk høgskole skal legge til rette for et internasjonalt semester innenfor 4-årig grunnskolelærerutdanning .

source: ( 2 ) Oahpuid lágideapmi Vuođđoskuvlaoahpaheaddjeoahpu 1.–7. dássi : 1.–3 . oahppojahki : Hárjehallanoahppu Pedagogihkka ja oahppimáhttu 60 oahppočuoggá Sámegiella 30 oahppočuoggá Dárogiella 30 oahppočuoggá Matematihkka 30 oahppočuoggá Oahpahusfága 60 oahppočuoggá 4. oahppojahki : Hárjehallanoahppu Oahpahusfága 60 oahppočuoggá , vejolaččat guokte fága goabbáge 30 oahppočuoggá , main nubbi sáhttá leat 30 oahppočuoggá skuvlarelevánta fága .
nob: ( 2 ) Studienes oppbygging Grunnskolelærerutdanningen 1.–7. trinn : 1.–3. studieår : Praksisopplæring Pedagogikk og elevkunnskap 60 studiepoeng Samisk 30 studiepoeng Norsk 30 studiepoeng Matematikk 30 studiepoeng Undervisningsfag 60 studiepoeng 4. studieår Praksisopplæring Undervisningsfag 60 studiepoeng , eventuelt to fag på 30 studiepoeng , hvorav ett kan være et skolerelevant fag på 30 studiepoeng
